# 自幂数
# 是指一个n位整数，它的各位数字的n次方之各等于它本身。也称阿姆斯特朗数。
# 一位自幂数：独身数
# 两位自幂数：没有
# 三位自幂数：水仙花数153，370，371，407
# 四位自幂数：四叶玫瑰数1634，8208，9474
# 五位自幂数：五角星数54748，92727，93084
# 六位自幂数：六合数548834
# 七位自幂数：北斗七星数1741725，4210818，9800817，9926315
# 八位自幂数：八仙数24678050，24678051，88593477
# 九位自幂数：九九重阳数146511208, 472335975, 534494836, 912985153
# 十位自幂数：十全十美数4679307774
# 最大的水仙花数有39位。十进制自然数中的所有水仙花数共有88个。

def narcissistic_number(num):
    sum_num = 0
    length = len(str(num))
    for item in str(num):
        sum_num += int(item) ** length
    if sum_num == num:
        return True
    else:
        return False


for i in range(100, 10 ** 8):
    if narcissistic_number(i):
        print(i)
