# 创建列表
class12 = [
    "01张晴晴",
    "02吴佳煜",
    "03钱秋萍",
    "00徐红明",
    "05邹佳芸",
    "06朱蒋岚",
    "07赵怡月",
    "08游欣悦",
    "09沈雨洋",
    "10徐佳雨",
    "11王欣怡",
    "12陈皖晴",
    "13朱辰媛",
    "14孙俏",
    "15李宜霏",
    "16任煜霏",
    "17台育蕊",
    "18陈慧",
    "19何雪",
    "20莫佳妮",
    "21顾心怡",
    "22杨钰雯",
    "23苏雨欣",
    "24曾海瑞",
    "25张权凯",
    "26江宇轩",
    "27陈晨",
    "28陈浩",
    "29蒋熠晨",
    "30张思诚",
    "31罗一鸣",
    "32杨熠恒",
    "33周昊天",
    "34曹国梁",
    "35王奇",
    "36沈心源",
    "37沈振亓",
    "38周顺利",
    "39康治坤",
    "40周杰",
    "41陆小凡",
    "42沈航宇",
    "43徐天成",
    "44鲍宇",
    "45王缪丞"
    ]

# 列表末尾添加元素 列表.append(元素值)
# class12.append("46庞宇帆")    # append 在列表末尾增加元素

# 打印列表： print(列表)
# print(class12)

# 遍历列表
# for item in class12:
#    print(item)

# 列表指定位置插入元素  列表.insert(索引号, 元素值)
# class12.insert(4, "04陆诗颖")  # insert 指定位置插入元素

# 删除元素  列表.remove(元素值)
# class12.remove("00徐红明")                # 删除列表中第一个元素

# 删除元素  del 列表[索引号]#
# del class12[5]                # 删除指定位置元素

# 弹出元素  列表.pop(索引号)
# item = class12.pop(0)
# print(item)
# print(class12)

# 列表长度： len(列表)
# print('班级人数：', len(class12))

# 随机选择：random.choice()
# import random
# item = random.choice(class12)
# print('幸运儿是：', item)
# class12.remove(item)
