import win32com.client


books_data = [
    ('978-7-1153-0972-3', '宇宙之书——从托勒密、爱因斯坦到多重宇宙', '约翰·D.巴罗', '科普', '2014-04-03', 10),
    ('978-7-3024-0433-0', '山海经', '孙见坤', '文学', '2015-11-01', 24),
    ('978-7-5379-6326-8', '中国的地形·壮美画卷', '贾文毓', '地理', '2015-02-01', 10),
    ('978-7-5624-9236-8', '天文之书', '吉姆·贝尔', '科普', '2015-10-25', 18),
    ('978-7-5193-0020-3', '中国通史“慢读”系列', '吕思勉', '历史', '2016-02-01', 10),
    ('978-7-5143-4589-6', '力学原来这么有趣！', '大井喜久夫', '科普', '2016-05-01', 15),
    ('978-7-1001-1969-6', '西游记', '吴承恩', '小说', '1980-01-01', 39),
    ('978-7-0200-0872-8', '三国演义', '罗贯中', '小说', '1998-01-01', 30),
    ('978-7-5533-2335-0', '资治通鉴', '司马光', '历史', '2000-01-01', 15),
    ('978-7-5039-3471-1', '孙中山传', '尚明轩', '人物', '2008-03-01', 13),
    ('978-7-5499-8387-2', '教育写作', '颜莹', '教育', '2020-03-01', 19),
    ('978-7-5584-2000-9', '剑桥地球通史', '克里斯托弗·劳埃德', '科普', '2020-09-01', 19),
    ('978-7-5168-2762-8', '趣说中国史：如果把中国422位皇帝放在一个群里，他们会聊些什么？', '趣哥', '历史', '2020-11-01', 7),
    ('978-7-2080-6164-4', '追风筝的人', '卡勒德·胡赛尼', '小说', '2006-05-01', 16),
    ('978-7-5682-5561-5', '我们的中国(写给孩子的中国地理)', '洋洋兔', '百科全书', '2020-05-16', 18),
    ('978-7-5596-3024-7', '逆袭', '李源', '小说', '2018-07-03', 13),
    ('978-7-2011-6169-3', '蛤蟆先生去看心理医生', '罗伯特·戴博德', '心理学', '2020-07-01', 18),
    ('978-1-0304-8407-7', '罗生门', '芥川龙之介', '小说', '2019-08-01', 12),
    ('978-7-5113-7951-1', '诗经名物图解', '细井徇', '文学', '2019-12-01', 10),
    ('978-7-5443-3479-2', '次第花开:藏人精神保持愉悦的秘密', '希阿荣博堪布', '哲学', '2011-03-01', 10),
    ('978-7-5534-1499-7', '古希腊演说辞全集-阿提卡演说家合辑', '安提丰', '文学', '2016-04-01', 10),
    ('978-7-5317-3898-5', '密丝特拉儿诗集', '密丝特拉儿', '文学', '2017-08-01', 10),
    ('978-7-5502-7357-3', '到山中去', '丰子恺', '文学', '2019-07-01', 10),
    ('978-7-5596-1229-8', '我是可爱的水母,我爱好放暗箭', '捷安特·潘达', '动漫', '2018-01-01', 10),
    ('978-7-5396-5608-3', '我弥留之际', '威廉·福克纳', '小说', '2016-05-01', 10),
    ('978-7-5546-1442-6', '人间草木', '汪曾祺', '文学', '2018-02-01', 10)
    ]

mdb_file = "Database2.mdb"  # 数据库文件
conn = win32com.client.Dispatch(r"ADODB.Connection")  # 建立连接对象
DSN = 'PROVIDER = Microsoft.ACE.OLEDB.12.0;DATA SOURCE = {}'.format(mdb_file)  # Access2007及以后
conn.Open(DSN)  # 用游标打开数据连接

for data in books_data:
    rs = win32com.client.Dispatch(r'ADODB.Recordset')
    sql = """SELECT ISBN FROM book
             WHERE ISBN='{}'""".format(data[0])
    rs.Open(sql, conn, 1, 1)

    if rs.EOF:
        sql = """INSERT INTO book (ISBN,书名,作者,类型,出版日期,数量)
                 VALUES {}""".format(data)
    else:
        sql = """UPDATE book
                 SET 数量=数量+{}
                 WHERE ISBN='{}'""".format(data[-1], data[0])   # 更新

    conn.Execute(sql)  # 执行sql语句

conn.Close()
