# 尝试用二分法求解方程x**3-X*2+x-2=0

def f(x):
    return ?  # 【补】函数表达式


# 要保证 f(x1) * f(x2) < 0 才能确认方程在(x1, x2)内有解
x1 = ?(input("请输入有解单调区间左边界："))  # 【补】？处用何类型转换函数
x2 = ?(input("请输入有解单调区间右边界："))  # 【补】？处用何类型转换函数
while abs(x2 - x1) > 1e-13:  # 即|x2-x1|>10**(-13)
    x0 = ?  # 【补】xo表示中间值
    if f(x1) * f(x0) < 0:  # 函数f在（x1, x0)有解
        ? = x0  # 【补】哪侧边界更新为中间值
    if f(x2) * f(x0) < 0:  # 函数f在（x0, x2)有解
        ? = x0  # 【补】哪侧边界更新为中间值
    if f(x0) == 0:  # x0为解，直接跳出循环
        ?  # 【补】跳出循环用什么？

print("方程解为：", x0)

input("运行完毕，请按回车键退出...")
