import random  # 导入随机模块


# 班级学生名单列表
bj = [
    "01张晴晴", "02吴佳煜", "03钱秋萍", "04陆诗颖", "05邹佳芸", "06朱蒋岚", "07赵怡月", "08游欣悦",
    "09沈雨洋", "10徐佳雨", "11王欣怡", "12陈皖晴", "13朱辰媛", "14孙俏",   "15李宜霏", "16任煜霏",
    "17台育蕊", "18陈慧",   "19何雪",   "20莫佳妮", "21顾心怡", "22杨钰雯", "23苏雨欣", "24曾海瑞",
    "25张权凯", "26江宇轩", "27陈晨",   "28陈浩",   "29蒋熠晨", "30张思诚", "31罗一鸣", "32杨熠恒",
    "33周昊天", "34曹国梁", "35王奇",   "36沈心源", "37沈振亓", "38周顺利", "39康治坤", "40周杰",
    "41陆小凡", "42沈航宇", "43徐天成", "44鲍宇",   "45王缪丞", "46庞宇帆"
    ]


"""列表有关操作说明：
列表末尾添加元素： 列表.append('元素')
列表指定位置插入元素： 列表.insert(索引号,'元素')
打印列表： print(列表)
删除元素：①通过索引删除指定元素 → del 列表[索引号]
删除元素：②移除元素 → 列表.remove(元素)
删除元素：③弹出元素并返回值 → 列表.pop(索引号)
列表长度： len(列表)
机抽5人： 打乱顺序  import random → random.shuffle(列表)
随机抽选5次： import random→random.choice(列表)
"""

# 请在下面定上你的代码



input('程序运行完毕，按回车键退出···')
